---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DimLeaderType
source: html/ff8bf7b0-c88b-16d3-da58-d67f90df4e27.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DimLeaderType Property

"Leader Type"

## Syntax (C#)
```csharp
public static ForgeTypeId DimLeaderType { get; }
```